; domain
(define (domain panys-i-claus-simple)
    (:requirements :strips :typing)

    (:types
        agent casella clau porta - objecte
    )

    (:predicates
        (esta-a ?a - agent ?ca - casella)
        (clau-a ?c - clau ?ca - casella)
        (porta-a ?p - porta ?ca - casella)
        (sortida-a ?ca - casella)

        (casella-buida ?ca - casella)
        (te-clau ?c - clau) 

        (connectades ?ca1 - casella ?ca2 - casella)
        (clau-per-porta ?c - clau ?p - porta)
        
        (es-casella-normal ?ca - casella)
    )

    (:action moure-normal
        :parameters (?a - agent ?origen - casella ?desti - casella)
        :precondition (and
            (esta-a ?a ?origen)
            (connectades ?origen ?desti)
            (casella-buida ?desti)
            (es-casella-normal ?desti)
        )
        :effect (and
            (not (esta-a ?a ?origen))
            (esta-a ?a ?desti)
            (casella-buida ?origen)
            (not (casella-buida ?desti))
        )
    )

    (:action moure-i-agafar-clau
        :parameters (?a - agent ?origen - casella ?desti - casella ?c - clau)
        :precondition (and
            (esta-a ?a ?origen)
            (connectades ?origen ?desti)
            (casella-buida ?desti)
            (clau-a ?c ?desti)
        )
        :effect (and
            (not (esta-a ?a ?origen))
            (esta-a ?a ?desti)
            (casella-buida ?origen)
            (not (casella-buida ?desti))
            (te-clau ?c)
            (not (clau-a ?c ?desti))
            (es-casella-normal ?desti)
        )
    )

    (:action moure-per-porta
        :parameters (?a - agent ?origen - casella ?desti - casella ?p - porta ?c - clau)
        :precondition (and
            (esta-a ?a ?origen)
            (connectades ?origen ?desti)
            (casella-buida ?desti)
            (porta-a ?p ?desti)
            (clau-per-porta ?c ?p)
            (te-clau ?c)
        )
        :effect (and
            (not (esta-a ?a ?origen))
            (esta-a ?a ?desti)
            (casella-buida ?origen)
            (not (casella-buida ?desti))
            (es-casella-normal ?desti)
        )
    )
    
    (:action moure-a-sortida
        :parameters (?a - agent ?origen - casella ?desti - casella)
        :precondition (and
            (esta-a ?a ?origen)
            (connectades ?origen ?desti)
            (casella-buida ?desti)
            (sortida-a ?desti)
        )
        :effect (and
            (not (esta-a ?a ?origen))
            (esta-a ?a ?desti)
            (casella-buida ?origen)
            (not (casella-buida ?desti))
        )
    )
)

; problem
(define (problem mapa-a-simple)
    (:domain panys-i-claus-simple)

    (:objects
        agent1 agent2 - agent
        clau-a - clau
        porta-A - porta
        
        c-1-1 c-1-2 c-1-3 c-1-4 c-1-5 c-1-6 - casella
        c-2-1 c-2-2 c-2-3 c-2-4 c-2-6 - casella
        c-3-1 c-3-2 c-3-3 c-3-4 c-3-5 c-3-6 - casella
    )

    (:init
        (clau-per-porta clau-a porta-A)

        (esta-a agent1 c-3-4)
        (esta-a agent2 c-1-2)

        (clau-a clau-a c-2-1)
        (porta-a porta-A c-3-6)
        (sortida-a c-2-6)

        (es-casella-normal c-1-1) (es-casella-normal c-1-3) (es-casella-normal c-1-4) (es-casella-normal c-1-5) (es-casella-normal c-1-6)
        (es-casella-normal c-2-2) (es-casella-normal c-2-3) (es-casella-normal c-2-4)
        (es-casella-normal c-3-1) (es-casella-normal c-3-2) (es-casella-normal c-3-3) (es-casella-normal c-3-5)

        (casella-buida c-1-1) (casella-buida c-1-3) (casella-buida c-1-4) (casella-buida c-1-5) (casella-buida c-1-6)
        (casella-buida c-2-1) (casella-buida c-2-2) (casella-buida c-2-3) (casella-buida c-2-4) (casella-buida c-2-6)
        (casella-buida c-3-1) (casella-buida c-3-2) (casella-buida c-3-3) (casella-buida c-3-5) (casella-buida c-3-6)

        (connectades c-1-1 c-1-2) (connectades c-1-2 c-1-1)
        (connectades c-1-2 c-1-3) (connectades c-1-3 c-1-2)
        (connectades c-1-3 c-1-4) (connectades c-1-4 c-1-3)
        (connectades c-1-4 c-1-5) (connectades c-1-5 c-1-4)
        (connectades c-1-5 c-1-6) (connectades c-1-6 c-1-5)

        (connectades c-2-1 c-2-2) (connectades c-2-2 c-2-1)
        (connectades c-2-2 c-2-3) (connectades c-2-3 c-2-2)
        (connectades c-2-3 c-2-4) (connectades c-2-4 c-2-3)

        (connectades c-3-1 c-3-2) (connectades c-3-2 c-3-1)
        (connectades c-3-2 c-3-3) (connectades c-3-3 c-3-2)
        (connectades c-3-3 c-3-4) (connectades c-3-4 c-3-3)
        (connectades c-3-4 c-3-5) (connectades c-3-5 c-3-4)
        (connectades c-3-5 c-3-6) (connectades c-3-6 c-3-5)

        (connectades c-1-1 c-2-1) (connectades c-2-1 c-1-1)
        (connectades c-2-1 c-3-1) (connectades c-3-1 c-2-1)

        (connectades c-1-2 c-2-2) (connectades c-2-2 c-1-2)
        (connectades c-2-2 c-3-2) (connectades c-3-2 c-2-2)

        (connectades c-1-3 c-2-3) (connectades c-2-3 c-1-3)
        (connectades c-2-3 c-3-3) (connectades c-3-3 c-2-3)

        (connectades c-1-4 c-2-4) (connectades c-2-4 c-1-4)
        (connectades c-2-4 c-3-4) (connectades c-3-4 c-2-4)

        (connectades c-1-6 c-2-6) (connectades c-2-6 c-1-6)
        (connectades c-2-6 c-3-6) (connectades c-3-6 c-2-6)
    )

    (:goal
        (or
            (esta-a agent1 c-2-6)
            (esta-a agent2 c-2-6)
        )
    )
)

; plan
1. (moure-normal agent1 c-3-4 c-3-5)
   deleted: (esta-a agent1 c-3-4) (casella-buida c-3-5)
   added: (esta-a agent1 c-3-5) (casella-buida c-3-4)
   goals met: 0 of 1
2. (moure-normal agent2 c-1-2 c-1-1)
   deleted: (esta-a agent2 c-1-2) (casella-buida c-1-1)
   added: (esta-a agent2 c-1-1) (casella-buida c-1-2)
   goals met: 0 of 1
3. (moure-i-agafar-clau agent2 c-1-1 c-2-1 clau-a)
   deleted: (esta-a agent2 c-1-1) (casella-buida c-2-1) (clau-a clau-a c-2-1)
   added: (esta-a agent2 c-2-1) (casella-buida c-1-1) (te-clau clau-a) (es-casella-normal c-2-1)
   goals met: 0 of 1
4. (moure-per-porta agent1 c-3-5 c-3-6 porta-a clau-a)
   deleted: (esta-a agent1 c-3-5) (casella-buida c-3-6)
   added: (esta-a agent1 c-3-6) (casella-buida c-3-5) (es-casella-normal c-3-6)
   goals met: 0 of 1
5. (moure-a-sortida agent1 c-3-6 c-2-6)
   deleted: (esta-a agent1 c-3-6) (casella-buida c-2-6)
   added: (esta-a agent1 c-2-6) (casella-buida c-3-6)
   goals met: 1 of 1
